import React from 'react';
import './PropsVSstate.css';

const Propsvstate = () => {
    return (
        <div className="padding">
            <h2 style={{ textAlign: 'center' }}>প্রপস ও স্টেট এর মধ্যে পার্থক্য কি?</h2>
            <h4>প্রপস:</h4>
            <p>১. প্রপস হচ্ছে ইমিউটেবল ।</p>
            <p>২. প্রপগুলি একটি উপাদান দ্বারা বাহ্যিক পরিবেশ থেকে ডেটা পেতে ব্যবহৃত হয় ।</p>
            <p>৩. প্রপসের পারফরমেন্স অনেক ভালো ।</p>
            <p>৪. উপরের স্তরের উপাদান</p>

            <h4>স্টেট:</h4>
            <p>১. স্টেট হচ্ছে মিউটেবল ।</p>
            <p>২. স্টেট একটি উপাদানের অভ্যন্তরীণ পরিবেশ পরিচালনা করতে ব্যবহৃত হয় মানে উপাদানটির ভিতরে ডেটা পরিবর্তন হয় ।</p>
            <p>৩. স্টেট এর পারফরমেন্স বেশি ভালো না ।</p>
            <p>৪. উপরের স্তরের উপাদান</p>
        </div>
    );
};

export default Propsvstate;